Documents/КорректировкаНачислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>КорректировкаНачислений</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РасчетыПоРегиональнымСубсидиям</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыПоЛьготам</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыПоСубсидиям</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыПоСубсидиям</xr:Item>
				<xr:Item>AccumulationRegister.РасшифровкаНачисленияЛьгот</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыПоЛицевымСчетам</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыПоРегиональнымСубсидиям</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЛицевыеСчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКорректировки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодКорректировки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНачисления</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыНачислений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Льгота</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Льготы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Льготчик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ВидыНачислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыНачислений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Начисление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пени</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Субсидия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Льгота</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазовоеНачисление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перерасчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Корректировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегиональнаяСубсидия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КачествоУслуги</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/КорректировкаНачислений/Forms/ФормаДокумента/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Процедура - обработчик события ПриСозданииНаСервере.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОСМДСервер.ЗаполнитьШапкуДокумента(
		Объект,
		,
		Параметры.ЗначениеКопирования,
		Параметры.Основание,
		СостояниеДокумента,
		КартинкаСостоянияДокумента,
		РазрешеноПроведение,
		ПоследнееИзменение,
		Параметры.ЗначенияЗаполнения);
		
	Локализация.ПриСозданииНаСервере(ЭтаФорма, Объект.Ссылка);
		
КонецПроцедуры

// Процедура - обработчик события ПослеЗаписи.
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОСМДКлиент.ОбновитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента, РазрешеноПроведение, ПоследнееИзменение);
	
КонецПроцедуры

// Процедура - обработчик события ПриЧтенииНаСервере.
//
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Объект.ЛицевыеСчета.Количество() > 0 И НЕ Объект.Организация = ВыбранноеЗначение Тогда
		
		Ответ = Вопрос(НСтр("ru='Перед изменением табличная часть будет очищена. Продолжить?';uk='Перед зміною таблична частина буде очищена. Продовжити?'"),
		РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			СтандартнаяОбработка = Ложь;
			Возврат;
		КонецЕсли;
		
		Объект.ЛицевыеСчета.Очистить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗданиеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Объект.ЛицевыеСчета.Количество() > 0 И НЕ Объект.Здание = ВыбранноеЗначение Тогда
		
		Ответ = Вопрос(НСтр("ru='Перед изменением табличная часть будет очищена. Продолжить?';uk='Перед зміною таблична частина буде очищена. Продовжити?'"),
		РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			СтандартнаяОбработка = Ложь;
			Возврат;
		КонецЕсли;
		
		Объект.ЛицевыеСчета.Очистить();
		
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура - обработчик команды "Подбор".
//
&НаКлиенте
Процедура Подбор(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Организация)  Тогда
		ТекстСообщения = НСтр("ru='Не заполнен реквизит Организация.';uk='Не заповнений реквізит Організація.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
		
	ПараметрыЗаполнения = Новый Структура;
	
	ПараметрыЗаполнения.Вставить("ОтборОрганизация",	Объект.Организация);
	ПараметрыЗаполнения.Вставить("ОтборЗдание",			Объект.Здание);
	
	АдресЛицевыхСчетовВХранилище = ОткрытьФормуМодально("ОбщаяФорма.ФормаПодбораЛицевыхСчетов", ПараметрыЗаполнения);
	
	Если ЗначениеЗаполнено(АдресЛицевыхСчетовВХранилище) Тогда
		ПолучитьЛицевыеСчетаИзХранилища(АдресЛицевыхСчетовВХранилище);
	КонецЕсли;
	
КонецПроцедуры

// Функция получает список лицевых счетов из временного хранилища
//
&НаСервере
Процедура ПолучитьЛицевыеСчетаИзХранилища(АдресЛицевыхСчетовВХранилище)
	
	ТаблицаДляЗагрузки	= ПолучитьИзВременногоХранилища(АдресЛицевыхСчетовВХранилище);
	
	Для Каждого СтрокаТаблицаДляЗагрузки Из ТаблицаДляЗагрузки Цикл
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("ЛицевойСчет",	СтрокаТаблицаДляЗагрузки.ЛицевойСчет);
		Строки = Объект.ЛицевыеСчета.НайтиСтроки(СтруктураОтбора);
		Если Строки.Количество() > 0 Тогда
			ЗаполнитьЗначенияСвойств(Строки[0], СтрокаТаблицаДляЗагрузки);
		Иначе
			НоваяСтрока = Объект.ЛицевыеСчета.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицаДляЗагрузки);
		КонецЕсли;
			
	КонецЦикла;
	
КонецПроцедуры // ПолучитьЛицевыеСчетаИзХранилища()

// Процедура - обработчик события НачалоВыбора поля ввода "ЛицевойСчет" табличной части "ЛицевыеСчета".
//
&НаКлиенте
Процедура ЛицевыеСчетаЛицевойСчетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыВыбораЗначения = Новый Структура;
	ПараметрыВыбораЗначения.Вставить("ОтборОрганизация",	Объект.Организация);
	ПараметрыВыбораЗначения.Вставить("ОтборЗдание",			Объект.Здание);

	ОткрытьФорму("Справочник.ЛицевыеСчета.Форма.ФормаВыбораСОтбором", ПараметрыВыбораЗначения, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевыеСчетаВидНачисленияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ЛицевыеСчета.ТекущиеДанные;
	
	Если ТекущиеДанные.ВидНачисления <> ПредопределенноеЗначение("Перечисление.ВидыНачислений.Льгота") Тогда
		
		ТекущиеДанные.Льгота = Неопределено;	
		ТекущиеДанные.Льготчик = Неопределено;	
	
	КонецЕсли; 	
	
КонецПроцедуры
